# Terraform environment prod
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_key_vault_certificate.vpn: Reading...
data.azurerm_key_vault_certificate.vpn: Read complete after 0s [id=https://kvaltinnauth001hub.vault.azure.net/certificates/VPNRootCert/cb902c29765447f6be8aed0081f9a8b6]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # azuread_application.vpn will be created
  + resource "azuread_application" "vpn" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "Product: Authorization VPN"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "48587eaa-8f33-43ed-a0c3-108c3681e84b",
          + "a9585a64-20f0-4d18-aba6-9930f92b809c",
          + "be1a510a-db1e-473c-a73a-558cdb68e353",
        ]
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + api {
          + requested_access_token_version = 2

          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access the VPN API on behalf of the signed-in user."
              + admin_consent_display_name = "Access VPN API"
              + enabled                    = true
              + id                         = "101e9ced-01bc-7b00-3640-7e8d1f57ed73"
              + type                       = "Admin"
              + value                      = "VPN.Access"
            }
        }
    }

  # azuread_application_identifier_uri.vpn will be created
  + resource "azuread_application_identifier_uri" "vpn" {
      + application_id = (known after apply)
      + id             = (known after apply)
      + identifier_uri = (known after apply)
    }

  # azuread_application_pre_authorized.vpn will be created
  + resource "azuread_application_pre_authorized" "vpn" {
      + application_id       = (known after apply)
      + authorized_client_id = "c632b3df-fb67-4d84-bdcf-b95ad541b5c8"
      + id                   = (known after apply)
      + permission_ids       = [
          + "101e9ced-01bc-7b00-3640-7e8d1f57ed73",
        ]
    }

  # azuread_service_principal.vpn will be created
  + resource "azuread_service_principal" "vpn" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)
    }

  # azurerm_private_dns_resolver.resolver will be updated in-place
  ~ resource "azurerm_private_dns_resolver" "resolver" {
        id                  = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/dnsResolvers/dnsresaltinnauth001hub"
        name                = "dnsresaltinnauth001hub"
      ~ tags                = {
          ~ "CreatedAt"   = "1/10/2025 3:03:03 PM" -> "2025-01-10T15:03:03Z"
            "Environment" = "hub"
            "Instance"    = "001"
            "ProductName" = "auth"
        }
        # (3 unchanged attributes hidden)
    }

  # azurerm_role_assignment.key_vault_administrator will be destroyed
  # (because resource uses count or for_each)
  - resource "azurerm_role_assignment" "key_vault_administrator" {
      - id                   = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.KeyVault/vaults/kvaltinnauth001hub/providers/Microsoft.Authorization/roleAssignments/a7f3ba0d-c814-44bf-739f-62ec7a79c93e" -> null
      - name                 = "a7f3ba0d-c814-44bf-739f-62ec7a79c93e" -> null
      - principal_id         = "a9585a64-20f0-4d18-aba6-9930f92b809c" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/providers/Microsoft.Authorization/roleDefinitions/00482a5a-887f-4fb3-b363-3b7fe8e74483" -> null
      - role_definition_name = "Key Vault Administrator" -> null
      - scope                = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.KeyVault/vaults/kvaltinnauth001hub" -> null
    }

  # azurerm_role_assignment.key_vault_administrator["48587eaa-8f33-43ed-a0c3-108c3681e84b"] will be created
  + resource "azurerm_role_assignment" "key_vault_administrator" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "48587eaa-8f33-43ed-a0c3-108c3681e84b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.KeyVault/vaults/kvaltinnauth001hub"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.key_vault_administrator["a9585a64-20f0-4d18-aba6-9930f92b809c"] will be created
  + resource "azurerm_role_assignment" "key_vault_administrator" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a9585a64-20f0-4d18-aba6-9930f92b809c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.KeyVault/vaults/kvaltinnauth001hub"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.key_vault_administrator["be1a510a-db1e-473c-a73a-558cdb68e353"] will be created
  + resource "azurerm_role_assignment" "key_vault_administrator" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "be1a510a-db1e-473c-a73a-558cdb68e353"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.KeyVault/vaults/kvaltinnauth001hub"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.rbac["48587eaa-8f33-43ed-a0c3-108c3681e84b"] will be created
  + resource "azurerm_role_assignment" "rbac" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "48587eaa-8f33-43ed-a0c3-108c3681e84b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "App Configuration Data Owner"
      + scope                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.rbac["a9585a64-20f0-4d18-aba6-9930f92b809c"] will be created
  + resource "azurerm_role_assignment" "rbac" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a9585a64-20f0-4d18-aba6-9930f92b809c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "App Configuration Data Owner"
      + scope                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.rbac["be1a510a-db1e-473c-a73a-558cdb68e353"] will be created
  + resource "azurerm_role_assignment" "rbac" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "be1a510a-db1e-473c-a73a-558cdb68e353"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "App Configuration Data Owner"
      + scope                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_storage_blob.client_key_cert["github"] will be created
  + resource "azurerm_storage_blob" "client_key_cert" {
      + access_tier            = "Cool"
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "github/githubKey.pem"
      + parallelism            = 8
      + size                   = 0
      + source_content         = (sensitive value)
      + storage_account_name   = "staltinnauth001hub"
      + storage_container_name = "vpncerts"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.client_pem_cert["github"] will be created
  + resource "azurerm_storage_blob" "client_pem_cert" {
      + access_tier            = "Cool"
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "github/githubCert.pem"
      + parallelism            = 8
      + size                   = 0
      + source_content         = (known after apply)
      + storage_account_name   = "staltinnauth001hub"
      + storage_container_name = "vpncerts"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.client_pfx_cert["github"] will be created
  + resource "azurerm_storage_blob" "client_pfx_cert" {
      + access_tier            = "Cool"
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "github/githubCert.pfx"
      + parallelism            = 8
      + size                   = 0
      + source_content         = (known after apply)
      + storage_account_name   = "staltinnauth001hub"
      + storage_container_name = "vpncerts"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_virtual_network_gateway.vpn will be created
  + resource "azurerm_virtual_network_gateway" "vpn" {
      + active_active                         = false
      + bgp_route_translation_for_nat_enabled = false
      + dns_forwarding_enabled                = false
      + enable_bgp                            = false
      + generation                            = (known after apply)
      + id                                    = (known after apply)
      + ip_sec_replay_protection_enabled      = true
      + location                              = "norwayeast"
      + name                                  = "vpnaltinnauth001hub"
      + private_ip_address_enabled            = false
      + remote_vnet_traffic_enabled           = false
      + resource_group_name                   = "rgaltinnauth001hub"
      + sku                                   = "VpnGw1"
      + type                                  = "Vpn"
      + virtual_wan_traffic_enabled           = false
      + vpn_type                              = "RouteBased"

      + ip_configuration {
          + name                          = "ip-config"
          + private_ip_address_allocation = "Dynamic"
          + public_ip_address_id          = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/publicIPAddresses/pipvpnaltinnauth001hub"
          + subnet_id                     = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/virtualNetworks/vnetaltinnauth001hub/subnets/GatewaySubnet"
        }

      + vpn_client_configuration {
          + aad_audience         = (known after apply)
          + aad_issuer           = "https://sts.windows.net/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/"
          + aad_tenant           = "https://login.microsoftonline.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
          + address_space        = [
              + "192.168.20.0/24",
            ]
          + vpn_auth_types       = [
              + "AAD",
              + "Certificate",
            ]
          + vpn_client_protocols = [
              + "OpenVPN",
            ]

          + root_certificate {
              + name             = "VPNRootCert"
              + public_cert_data = "MIIDMDCCAhigAwIBAgIRAJVnHQbw2xZX4O2FxVA5lXUwDQYJKoZIhvcNAQELBQAwKTEWMBQGA1UECxMNQXV0aG9yaXphdGlvbjEPMA0GA1UEAxMGQWx0aW5uMB4XDTI1MDExMDE1MDMwM1oXDTM1MDEwODE1MDMwM1owKTEWMBQGA1UECxMNQXV0aG9yaXphdGlvbjEPMA0GA1UEAxMGQWx0aW5uMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAw6DnRYgTOiPh1RfbTxoNGaWiFZ0B7j6EiIYBgMcexFz8wkKvLky7syWw//nQmZ8/naZlzPi0+KksGkPvmKVxnbKSMud89KdyULdqjFObsnuK/U5TC9jRE8OsJg3dFOsYEkSLgcDiBz25vXo6wH+u+J+94h4aJJmJk++ZmHU/JLcnUMPi+0dDF9txy4N4kHFhA93mX5Y91/DKpvGflKhK9rYZBdpSX4j3j/zSruyjpVmR1a2D3FalaEhKy3L6wiv1CoXjmO3RsrfH9z2aeghVzA36Ne9pfKbt/TWf1RiF7TYkq9N6i6Lc6mspATZLzObiqe7qDy8pKo6u9qGMwX6z4QIDAQABo1MwUTAPBgNVHRMBAf8EBTADAQH/MB0GA1UdDgQWBBQfDrUrYdCQXb+cq11y7kUxcERg5DAfBgNVHSMEGDAWgBQfDrUrYdCQXb+cq11y7kUxcERg5DANBgkqhkiG9w0BAQsFAAOCAQEADpAf1xP8QYPEO02E/p8cw5WnLBob8ngCbQNx9f6zNbuR8Bp2vRN6RJIvmWqwfmP1rN5USICRXHhJsZScc4kBeRaLp/KuhIqpouxYzLaxNBHh9J5vkTkRqIelB770a5kL+oi7EAI5SkgQ2OZoNN/qjgSWJYPFuyIWBTRglbvAOK5Gd62GzDKiq+jCoG2RzC33B1n8iLUXflBOxjNjQcFLcBJ6mrBrLYyGJabuu2lA/v6+aJEcj9jE2vg6wK1/bgfdRLtQpljEItIPB9/12/jxvjIwdJzFRpz0XAwd2YbU9U01QDtyEnV5iuAINHZEnqeCd7GBb45zJOmbVeBnnbemlA=="
            }
        }
    }

  # pkcs12_from_pem.client_certs["github"] will be created
  + resource "pkcs12_from_pem" "client_certs" {
      + ca_pem          = (sensitive value)
      + cert_pem        = (sensitive value)
      + encoding        = "modern2023"
      + id              = (known after apply)
      + private_key_pem = (sensitive value)
      + result          = (known after apply)
    }

  # tls_cert_request.client["github"] will be created
  + resource "tls_cert_request" "client" {
      + cert_request_pem = (known after apply)
      + dns_names        = [
          + "github",
        ]
      + id               = (known after apply)
      + key_algorithm    = (known after apply)
      + private_key_pem  = (sensitive value)

      + subject {
          + common_name = "github"
        }
    }

  # tls_locally_signed_cert.client["github"] will be created
  + resource "tls_locally_signed_cert" "client" {
      + allowed_uses          = [
          + "client_auth",
        ]
      + ca_cert_pem           = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIDMDCCAhigAwIBAgIRAJVnHQbw2xZX4O2FxVA5lXUwDQYJKoZIhvcNAQELBQAw
            KTEWMBQGA1UECxMNQXV0aG9yaXphdGlvbjEPMA0GA1UEAxMGQWx0aW5uMB4XDTI1
            MDExMDE1MDMwM1oXDTM1MDEwODE1MDMwM1owKTEWMBQGA1UECxMNQXV0aG9yaXph
            dGlvbjEPMA0GA1UEAxMGQWx0aW5uMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIB
            CgKCAQEAw6DnRYgTOiPh1RfbTxoNGaWiFZ0B7j6EiIYBgMcexFz8wkKvLky7syWw
            //nQmZ8/naZlzPi0+KksGkPvmKVxnbKSMud89KdyULdqjFObsnuK/U5TC9jRE8Os
            Jg3dFOsYEkSLgcDiBz25vXo6wH+u+J+94h4aJJmJk++ZmHU/JLcnUMPi+0dDF9tx
            y4N4kHFhA93mX5Y91/DKpvGflKhK9rYZBdpSX4j3j/zSruyjpVmR1a2D3FalaEhK
            y3L6wiv1CoXjmO3RsrfH9z2aeghVzA36Ne9pfKbt/TWf1RiF7TYkq9N6i6Lc6msp
            ATZLzObiqe7qDy8pKo6u9qGMwX6z4QIDAQABo1MwUTAPBgNVHRMBAf8EBTADAQH/
            MB0GA1UdDgQWBBQfDrUrYdCQXb+cq11y7kUxcERg5DAfBgNVHSMEGDAWgBQfDrUr
            YdCQXb+cq11y7kUxcERg5DANBgkqhkiG9w0BAQsFAAOCAQEADpAf1xP8QYPEO02E
            /p8cw5WnLBob8ngCbQNx9f6zNbuR8Bp2vRN6RJIvmWqwfmP1rN5USICRXHhJsZSc
            c4kBeRaLp/KuhIqpouxYzLaxNBHh9J5vkTkRqIelB770a5kL+oi7EAI5SkgQ2OZo
            NN/qjgSWJYPFuyIWBTRglbvAOK5Gd62GzDKiq+jCoG2RzC33B1n8iLUXflBOxjNj
            QcFLcBJ6mrBrLYyGJabuu2lA/v6+aJEcj9jE2vg6wK1/bgfdRLtQpljEItIPB9/1
            2/jxvjIwdJzFRpz0XAwd2YbU9U01QDtyEnV5iuAINHZEnqeCd7GBb45zJOmbVeBn
            nbemlA==
            -----END CERTIFICATE-----
        EOT
      + ca_key_algorithm      = (known after apply)
      + ca_private_key_pem    = (sensitive value)
      + cert_pem              = (known after apply)
      + cert_request_pem      = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + is_ca_certificate     = false
      + ready_for_renewal     = false
      + set_subject_key_id    = true
      + validity_end_time     = (known after apply)
      + validity_period_hours = 8760
      + validity_start_time   = (known after apply)
    }

  # tls_private_key.client["github"] will be created
  + resource "tls_private_key" "client" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

Plan: 18 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `push` |
| Working Directory | `infra/deploy/hub` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/prod/hub.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_prod_hub.tfstate.tfplan`